{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.9", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_3", "trainable": true}}]}