{"config": [{"config": {"strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "filters": 32}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "units": 512, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "units": 10, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow"}